Revit 2022 API
AnalyticalModel.ResetLinks Method
 The function is trying to recreate analytical link elements that were deleted by the user.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public void ResetLinks()
Visual Basic
Public Sub ResetLinks
Visual C++
public:
void ResetLinks()
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace